<!-- dflook/terraform-github-actions {"workspace":"closed-outputs-2","backend_type":"remote","backend":"b191486f8548e6514ad0f26b0c5084e2b3af0b48c3a7039183e9239a829f2458","plan_job_ref":"Job Test Terraform cloud #196 at https://github.com/dflook/terraform-github-actions/actions/runs/7140134569","plan_hash":"82efe14d51340d88d91d453090c723660d31fb74ff779b4bb3e680645fd2e128","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __closed-outputs-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.the_id will be created
  + resource "random_id" "the_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 5
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + default        = "default"
  + from_tfvars    = "from_tfvars"
  + from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #196](https://github.com/dflook/terraform-github-actions/actions/runs/7140134569)